wisdom0623/GD32_KB/USER/include/key.h
 // ======================================================================
 //
 //         Copyright (C) 2007-2008 Wisdom__Lee   
 //         All rights reserved
 //
 //         filename :KEY
 //         description :
 //
 //         created by Wisdom__Lee
 //          https://space.bilibili.com/14956861
 //
 // ======================================================================



#ifndef KEY_H
#define KEY_H


#include "gd32f10x_gpio.h"

#define u1_port GPIOC
#define u1_pin	GPIO_PIN_14

#define u2_port	GPIOB
#define u2_pin	GPIO_PIN_3


#define u3_port	GPIOB
#define u3_pin	GPIO_PIN_2

#define u4_port	GPIOC
#define u4_pin	GPIO_PIN_13



#define u5_port GPIOB
#define u5_pin	GPIO_PIN_8


#define u6_port GPIOA
#define u6_pin	GPIO_PIN_15


#define u7_port	GPIOB
#define u7_pin	GPIO_PIN_7

#define u8_port	GPIOB
#define u8_pin	GPIO_PIN_11

#define u9_port	GPIOB
#define u9_pin	GPIO_PIN_0


#define u10_port	GPIOB
#define u10_pin		GPIO_PIN_1

#define u11_port	GPIOB
#define u11_pin		GPIO_PIN_10


#define u12_port	GPIOA
#define u12_pin		GPIO_PIN_7

#define u13_port	GPIOB
#define u13_pin		GPIO_PIN_9

#define u14_port	GPIOA
#define u14_pin		GPIO_PIN_6

#define u15_port	GPIOB
#define u15_pin		GPIO_PIN_6

#define u16_port	GPIOC
#define u16_pin		GPIO_PIN_15

#define u17_port	GPIOB
#define u17_pin		GPIO_PIN_4

#define u18_port	GPIOB
#define u18_pin		GPIO_PIN_5

// All key in keyboard init
void key_all_init(void);

uint8_t data2(void);
uint8_t data3(void);
uint8_t data4(void);
uint8_t data5(void);
uint8_t data6(void);
uint8_t data7(void);
uint8_t data8(void);




#define Keyboard_a                4   // Keyboard a and A
#define Keyboard_b                5   // Keyboard b and B
#define Keyboard_c                6   // Keyboard c and C
#define Keyboard_d                7   // Keyboard d and D
#define Keyboard_e                8   // Keyboard e and E
#define Keyboard_f                9   // Keyboard f and F
#define Keyboard_g                10  // Keyboard g and G
#define Keyboard_h                11  // Keyboard h and H
#define Keyboard_i                12  // Keyboard i and I
#define Keyboard_j                13  // Keyboard j and J
#define Keyboard_k                14  // Keyboard k and K
#define Keyboard_l                15  // Keyboard l and L
#define Keyboard_m                16  // Keyboard m and M
#define Keyboard_n                17  // Keyboard n and N
#define Keyboard_o                18  // Keyboard o and O
#define Keyboard_p                19  // Keyboard p and P
#define Keyboard_q                20  // Keyboard q and Q
#define Keyboard_r                21  // Keyboard r and R
#define Keyboard_s                22  // Keyboard s and S
#define Keyboard_t                23  // Keyboard t and T
#define Keyboard_u                24  // Keyboard u and U
#define Keyboard_v                25  // Keyboard v and V
#define Keyboard_w                26  // Keyboard w and W
#define Keyboard_x                27  // Keyboard x and X
#define Keyboard_y                28  // Keyboard y and Y
#define Keyboard_z                29  // Keyboard z and Z
#define Keyboard_1                30  // Keyboard 1 and !
#define Keyboard_2                31  // Keyboard 2 and @
#define Keyboard_3                32  // Keyboard 3 and #
#define Keyboard_4                33  // Keyboard 4 and $
#define Keyboard_5                34  // Keyboard 5 and %
#define Keyboard_6                35  // Keyboard 6 and ^
#define Keyboard_7                36  // Keyboard 7 and &
#define Keyboard_8                37  // Keyboard 8 and *
#define Keyboard_9                38  // Keyboard 9 and (
#define Keyboard_0                39  // Keyboard 0 and )
#define Keyboard_ENTER            40  // Keyboard ENTER
#define Keyboard_ESCAPE           41  // Keyboard ESCAPE
#define Keyboard_Backspace        42  // Keyboard Backspace
#define Keyboard_Tab              43  // Keyboard Tab
#define Keyboard_KongGe           44  // Keyboard Spacebar
#define Keyboard_JianHao          45  // Keyboard - and _(underscore)
#define Keyboard_DengHao          46  // Keyboard = and +
#define Keyboard_ZuoZhongKuoHao   47  // Keyboard [ and {
#define Keyboard_YouZhongKuoHao   48  // Keyboard ] and }
#define Keyboard_FanXieGang       49  // Keyboard \ and |
#define Keyboard_FenHao           51  // Keyboard ; and :
#define Keyboard_DanYinHao        52  // Keyboard ‘ and “
#define Keyboard_BoLangXian       53  // Keyboard `(Grave Accent) and ~(Tilde)
#define Keyboard_Douhao           54  // Keyboard, and <
#define Keyboard_JuHao            55  // Keyboard . and >
#define Keyboard_XieGang_WenHao   56  // Keyboard / and ?
#define Keyboard_CapsLock         57  // Keyboard Caps Lock
#define Keyboard_F1               58  // Keyboard F1
#define Keyboard_F2               59  // Keyboard F2
#define Keyboard_F3               60  // Keyboard F3
#define Keyboard_F4               61  // Keyboard F4
#define Keyboard_F5               62  // Keyboard F5
#define Keyboard_F6               63  // Keyboard F6
#define Keyboard_F7               64  // Keyboard F7
#define Keyboard_F8               65  // Keyboard F8
#define Keyboard_F9               66  // Keyboard F9
#define Keyboard_F10              67  // Keyboard F10
#define Keyboard_F11              68  // Keyboard F11
#define Keyboard_F12              69  // Keyboard F12
#define Keyboard_PrintScreen      70  // Keyboard PrintScreen
#define Keyboard_ScrollLock       71  // Keyboard Scroll Lock
#define Keyboard_Pause            72  // Keyboard Pause
#define Keyboard_Insert           73  // Keyboard Insert
#define Keyboard_Home             74  // Keyboard Home
#define Keyboard_PageUp           75  // Keyboard PageUp
#define Keyboard_Delete           76  // Keyboard Delete
#define Keyboard_End              77  // Keyboard End
#define Keyboard_PageDown         78  // Keyboard PageDown
#define Keyboard_RightArrow       79  // Keyboard RightArrow
#define Keyboard_LeftArrow        80  // Keyboard LeftArrow
#define Keyboard_DownArrow        81  // Keyboard DownArrow
#define Keyboard_UpArrow          82  // Keyboard UpArrow
#define Keypad_NumLock            83  // Keypad Num Lock and Clear
#define Keypad_ChuHao             84  // Keypad /
#define Keypad_ChengHao           85  // Keypad *
#define Keypad_JianHao            86  // Keypad -
#define Keypad_JiaHao             87  // Keypad +
#define Keypad_ENTER              88  // Keypad ENTER
#define Keypad_1_and_End          89  // Keypad 1 and End
#define Keypad_2_and_DownArrow    90  // Keypad 2 and Down Arrow
#define Keypad_3_and_PageDn       91  // Keypad 3 and PageDn
#define Keypad_4_and_LeftArrow    92  // Keypad 4 and Left Arrow
#define Keypad_5                  93  // Keypad 5
#define Keypad_6_and_RightArrow   94  // Keypad 6 and Right Arrow
#define Keypad_7_and_Home         95  // Keypad 7 and Home
#define Keypad_8_and_UpArrow      96  // Keypad 8 and Up Arrow
#define Keypad_9_and_PageUp       97  // Keypad 9 and PageUp
#define Keypad_0_and_Insert       98  // Keypad 0 and Insert
#define Keypad_Dian_and_Delete    99  // Keypad . and Delete
#define Keyboard_Application      101 // Keyboard Application
#define Keyboard_LeftControl      224
#define Keyboard_LeftShift        225
#define Keyboard_LeftAlt          226
#define Keyboard_LeftWindows      227
#define Keyboard_RightControl     228
#define Keyboard_RightShift       229
#define Keyboard_RightAlt         230
#define Keyboard_RightWindows     231










#endif /* __KEY_H */


